// انشأت لكم مصفوفه بداخلها Objects
let products =[
    {name:"Doritos small", price:0.1},
    {name:"Doritos larg ", price:0.15},
    {name:"Doritos  xlarg", price:0.3},
]

// انشئ مصفوفه فارغه لتكون سلة المشتريات 




// هني راح تحطونلي الداله حق زر مسح السلة 




// هني راح تحطون الدالة عند الضغط  زر اضافة عنصر 








// مساعدة صغيرونه راح تستخدمون loop +
// هذا اهوا كود طباعة الكلام بس وين بتحطونه 👀

// document.getElementById("lest").innerHTML +=<li>${element.name} price ${element.price} KD